DataProcessors/ОбработкаОтбораВедомастейПоДатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаОтбораВедомастейПоДатам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/Ведомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Ведомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВедомостьДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.СимволыВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Литеры</Name>
					<Comment>Строковые символы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыСтрокой</Name>
					<Comment>Перечень ГУИД ссылок справочника договоры (разделитель";")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыТаблицей</Name>
					<Comment>Таблица значений с колонкой из ссылок справочника  договоры</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь создавший документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОбработкаОтбораВедомастейПоДатам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВывестиДоговоры(Команда)
	ВывестиДоговорыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиДоговорыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьДоговоры.Ссылка КАК ВедомостьВТ,
	|	ВЫБОР
	|		КОГДА &Величина
	|			ТОГДА МАКСИМУМ(Договоры.НачалоДействия)
	|		ИНАЧЕ МИНИМУМ(Договоры.НачалоДействия)
	|	КОНЕЦ КАК МинМакс
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВедомостьДоговоры.Договор = Договоры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьДоговоры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВедомостьДоговоры.Ссылка КАК Ведомость,
	|	Договоры.НачалоДействия КАК ДоговорНачалоДействия,
	|	ВременнаяТаблица.МинМакс КАК МинМакс
	|ИЗ
	|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (ВременнаяТаблица.ВедомостьВТ = ВедомостьДоговоры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВедомостьДоговоры.Договор = Договоры.Ссылка
	|ГДЕ
	|	ВедомостьДоговоры.НомерСтроки = 1
	|	И ВЫБОР
	|			КОГДА &Равенство
	|				ТОГДА ВременнаяТаблица.МинМакс = Договоры.НачалоДействия
	|			ИНАЧЕ НЕ ВременнаяТаблица.МинМакс = Договоры.НачалоДействия
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Равенство", Равенство);
	Запрос.УстановитьПараметр("Величина", Величина);
	
	ТабличнаяЧасть.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти
